frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.c
/* Based on CPU DB MC9S12XDP512_144, version 2.87.293 (RegistersPrg V1.081) */
/* DataSheet : 9S12XDP512DGV1/D V01.10 */

#include <MC9S12XDP512.h>


/* * * * *  8-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile ARMCOPSTR _ARMCOP;                                /* CRG COP Timer Arm/Reset Register */
volatile ATD0_PORTAD0STR _ATD0_PORTAD0;                    /* ATD 0 Port AD0 Register */
volatile ATD0DIENSTR _ATD0DIEN;                            /* ATD 0 Input Enable Register */
volatile ATD0STAT0STR _ATD0STAT0;                          /* ATD 0 Status Register 0 */
volatile ATD0STAT1STR _ATD0STAT1;                          /* ATD 0 Status Register 1 */
volatile ATD0STAT2STR _ATD0STAT2;                          /* ATD 0 Status Register 2 */
volatile ATD0TEST1STR _ATD0TEST1;                          /* ATD0 Test Register */
volatile ATD1_PORTAD0STR _ATD1_PORTAD0;                    /* ATD1 Port AD0 Register */
volatile ATD1_PORTAD1STR _ATD1_PORTAD1;                    /* ATD1 Port AD1 Register */
volatile ATD1DIEN0STR _ATD1DIEN0;                          /* ATD 1 Input Enable Register 0 */
volatile ATD1DIEN1STR _ATD1DIEN1;                          /* ATD 1 Input Enable Register 1 */
volatile ATD1STAT0STR _ATD1STAT0;                          /* ATD 1 Status Register 0 */
volatile ATD1STAT1STR _ATD1STAT1;                          /* ATD 1 Status Register 1 */
volatile ATD1STAT2STR _ATD1STAT2;                          /* ATD 1 Status Register 2 */
volatile ATD1TEST1STR _ATD1TEST1;                          /* ATD1 Test Register */
volatile CAN0BTR0STR _CAN0BTR0;                            /* MSCAN 0 Bus Timing Register 0 */
volatile CAN0BTR1STR _CAN0BTR1;                            /* MSCAN 0 Bus Timing Register 1 */
volatile CAN0CTL0STR _CAN0CTL0;                            /* MSCAN 0 Control 0 Register */
volatile CAN0CTL1STR _CAN0CTL1;                            /* MSCAN 0 Control 1 Register */
volatile CAN0IDACSTR _CAN0IDAC;                            /* MSCAN 0 Identifier Acceptance Control Register */
volatile CAN0IDAR0STR _CAN0IDAR0;                          /* MSCAN 0 Identifier Acceptance Register 0 */
volatile CAN0IDAR1STR _CAN0IDAR1;                          /* MSCAN 0 Identifier Acceptance Register 1 */
volatile CAN0IDAR2STR _CAN0IDAR2;                          /* MSCAN 0 Identifier Acceptance Register 2 */
volatile CAN0IDAR3STR _CAN0IDAR3;                          /* MSCAN 0 Identifier Acceptance Register 3 */
volatile CAN0IDAR4STR _CAN0IDAR4;                          /* MSCAN 0 Identifier Acceptance Register 4 */
volatile CAN0IDAR5STR _CAN0IDAR5;                          /* MSCAN 0 Identifier Acceptance Register 5 */
volatile CAN0IDAR6STR _CAN0IDAR6;                          /* MSCAN 0 Identifier Acceptance Register 6 */
volatile CAN0IDAR7STR _CAN0IDAR7;                          /* MSCAN 0 Identifier Acceptance Register 7 */
volatile CAN0IDMR0STR _CAN0IDMR0;                          /* MSCAN 0 Identifier Mask Register 0 */
volatile CAN0IDMR1STR _CAN0IDMR1;                          /* MSCAN 0 Identifier Mask Register 1 */
volatile CAN0IDMR2STR _CAN0IDMR2;                          /* MSCAN 0 Identifier Mask Register 2 */
volatile CAN0IDMR3STR _CAN0IDMR3;                          /* MSCAN 0 Identifier Mask Register 3 */
volatile CAN0IDMR4STR _CAN0IDMR4;                          /* MSCAN 0 Identifier Mask Register 4 */
volatile CAN0IDMR5STR _CAN0IDMR5;                          /* MSCAN 0 Identifier Mask Register 5 */
volatile CAN0IDMR6STR _CAN0IDMR6;                          /* MSCAN 0 Identifier Mask Register 6 */
volatile CAN0IDMR7STR _CAN0IDMR7;                          /* MSCAN 0 Identifier Mask Register 7 */
volatile CAN0MISCSTR _CAN0MISC;                            /* MSCAN 0 Miscellaneous Register */
volatile CAN0RFLGSTR _CAN0RFLG;                            /* MSCAN 0 Receiver Flag Register */
volatile CAN0RIERSTR _CAN0RIER;                            /* MSCAN 0 Receiver Interrupt Enable Register */
volatile CAN0RXDLRSTR _CAN0RXDLR;                          /* MSCAN 0 Receive Data Length Register */
volatile CAN0RXDSR0STR _CAN0RXDSR0;                        /* MSCAN 0 Receive Data Segment Register 0 */
volatile CAN0RXDSR1STR _CAN0RXDSR1;                        /* MSCAN 0 Receive Data Segment Register 1 */
volatile CAN0RXDSR2STR _CAN0RXDSR2;                        /* MSCAN 0 Receive Data Segment Register 2 */
volatile CAN0RXDSR3STR _CAN0RXDSR3;                        /* MSCAN 0 Receive Data Segment Register 3 */
volatile CAN0RXDSR4STR _CAN0RXDSR4;                        /* MSCAN 0 Receive Data Segment Register 4 */
volatile CAN0RXDSR5STR _CAN0RXDSR5;                        /* MSCAN 0 Receive Data Segment Register 5 */
volatile CAN0RXDSR6STR _CAN0RXDSR6;                        /* MSCAN 0 Receive Data Segment Register 6 */
volatile CAN0RXDSR7STR _CAN0RXDSR7;                        /* MSCAN 0 Receive Data Segment Register 7 */
volatile CAN0RXERRSTR _CAN0RXERR;                          /* MSCAN 0 Receive Error Counter Register */
volatile CAN0RXIDR0STR _CAN0RXIDR0;                        /* MSCAN 0 Receive Identifier Register 0 */
volatile CAN0RXIDR1STR _CAN0RXIDR1;                        /* MSCAN 0 Receive Identifier Register 1 */
volatile CAN0RXIDR2STR _CAN0RXIDR2;                        /* MSCAN 0 Receive Identifier Register 2 */
volatile CAN0RXIDR3STR _CAN0RXIDR3;                        /* MSCAN 0 Receive Identifier Register 3 */
volatile CAN0TAAKSTR _CAN0TAAK;                            /* MSCAN 0 Transmitter Message Abort Control */
volatile CAN0TARQSTR _CAN0TARQ;                            /* MSCAN 0 Transmitter Message Abort Request */
volatile CAN0TBSELSTR _CAN0TBSEL;                          /* MSCAN 0 Transmit Buffer Selection */
volatile CAN0TFLGSTR _CAN0TFLG;                            /* MSCAN 0 Transmitter Flag Register */
volatile CAN0TIERSTR _CAN0TIER;                            /* MSCAN 0 Transmitter Interrupt Enable Register */
volatile CAN0TXDLRSTR _CAN0TXDLR;                          /* MSCAN 0 Transmit Data Length Register */
volatile CAN0TXDSR0STR _CAN0TXDSR0;                        /* MSCAN 0 Transmit Data Segment Register 0 */
volatile CAN0TXDSR1STR _CAN0TXDSR1;                        /* MSCAN 0 Transmit Data Segment Register 1 */
volatile CAN0TXDSR2STR _CAN0TXDSR2;                        /* MSCAN 0 Transmit Data Segment Register 2 */
volatile CAN0TXDSR3STR _CAN0TXDSR3;                        /* MSCAN 0 Transmit Data Segment Register 3 */
volatile CAN0TXDSR4STR _CAN0TXDSR4;                        /* MSCAN 0 Transmit Data Segment Register 4 */
volatile CAN0TXDSR5STR _CAN0TXDSR5;                        /* MSCAN 0 Transmit Data Segment Register 5 */
volatile CAN0TXDSR6STR _CAN0TXDSR6;                        /* MSCAN 0 Transmit Data Segment Register 6 */
volatile CAN0TXDSR7STR _CAN0TXDSR7;                        /* MSCAN 0 Transmit Data Segment Register 7 */
volatile CAN0TXERRSTR _CAN0TXERR;                          /* MSCAN 0 Transmit Error Counter Register */
volatile CAN0TXIDR0STR _CAN0TXIDR0;                        /* MSCAN 0 Transmit Identifier Register 0 */
volatile CAN0TXIDR1STR _CAN0TXIDR1;                        /* MSCAN 0 Transmit Identifier Register 1 */
volatile CAN0TXIDR2STR _CAN0TXIDR2;                        /* MSCAN 0 Transmit Identifier Register 2 */
volatile CAN0TXIDR3STR _CAN0TXIDR3;                        /* MSCAN 0 Transmit Identifier Register 3 */
volatile CAN0TXTBPRSTR _CAN0TXTBPR;                        /* MSCAN 0 Transmit Buffer Priority */
volatile CAN1BTR0STR _CAN1BTR0;                            /* MSCAN 1 Bus Timing Register 0 */
volatile CAN1BTR1STR _CAN1BTR1;                            /* MSCAN 1 Bus Timing Register 1 */
volatile CAN1CTL0STR _CAN1CTL0;                            /* MSCAN 1 Control 0 Register */
volatile CAN1CTL1STR _CAN1CTL1;                            /* MSCAN 1 Control 1 Register */
volatile CAN1IDACSTR _CAN1IDAC;                            /* MSCAN 1 Identifier Acceptance Control Register */
volatile CAN1IDAR0STR _CAN1IDAR0;                          /* MSCAN 1 Identifier Acceptance Register 0 */
volatile CAN1IDAR1STR _CAN1IDAR1;                          /* MSCAN 1 Identifier Acceptance Register 1 */
volatile CAN1IDAR2STR _CAN1IDAR2;                          /* MSCAN 1 Identifier Acceptance Register 2 */
volatile CAN1IDAR3STR _CAN1IDAR3;                          /* MSCAN 1 Identifier Acceptance Register 3 */
volatile CAN1IDAR4STR _CAN1IDAR4;                          /* MSCAN 1 Identifier Acceptance Register 4 */
volatile CAN1IDAR5STR _CAN1IDAR5;                          /* MSCAN 1 Identifier Acceptance Register 5 */
volatile CAN1IDAR6STR _CAN1IDAR6;                          /* MSCAN 1 Identifier Acceptance Register 6 */
volatile CAN1IDAR7STR _CAN1IDAR7;                          /* MSCAN 1 Identifier Acceptance Register 7 */
volatile CAN1IDMR0STR _CAN1IDMR0;                          /* MSCAN 1 Identifier Mask Register 0 */
volatile CAN1IDMR1STR _CAN1IDMR1;                          /* MSCAN 1 Identifier Mask Register 1 */
volatile CAN1IDMR2STR _CAN1IDMR2;                          /* MSCAN 1 Identifier Mask Register 2 */
volatile CAN1IDMR3STR _CAN1IDMR3;                          /* MSCAN 1 Identifier Mask Register 3 */
volatile CAN1IDMR4STR _CAN1IDMR4;                          /* MSCAN 1 Identifier Mask Register 4 */
volatile CAN1IDMR5STR _CAN1IDMR5;                          /* MSCAN 1 Identifier Mask Register 5 */
volatile CAN1IDMR6STR _CAN1IDMR6;                          /* MSCAN 1 Identifier Mask Register 6 */
volatile CAN1IDMR7STR _CAN1IDMR7;                          /* MSCAN 1 Identifier Mask Register 7 */
volatile CAN1MISCSTR _CAN1MISC;                            /* MSCAN 1 Miscellaneous Register */
volatile CAN1RFLGSTR _CAN1RFLG;                            /* MSCAN 1 Receiver Flag Register */
volatile CAN1RIERSTR _CAN1RIER;                            /* MSCAN 1 Receiver Interrupt Enable Register */
volatile CAN1RXDLRSTR _CAN1RXDLR;                          /* MSCAN 1 Receive Data Length Register */
volatile CAN1RXDSR0STR _CAN1RXDSR0;                        /* MSCAN 1 Receive Data Segment Register 0 */
volatile CAN1RXDSR1STR _CAN1RXDSR1;                        /* MSCAN 1 Receive Data Segment Register 1 */
volatile CAN1RXDSR2STR _CAN1RXDSR2;                        /* MSCAN 1 Receive Data Segment Register 2 */
volatile CAN1RXDSR3STR _CAN1RXDSR3;                        /* MSCAN 1 Receive Data Segment Register 3 */
volatile CAN1RXDSR4STR _CAN1RXDSR4;                        /* MSCAN 1 Receive Data Segment Register 4 */
volatile CAN1RXDSR5STR _CAN1RXDSR5;                        /* MSCAN 1 Receive Data Segment Register 5 */
volatile CAN1RXDSR6STR _CAN1RXDSR6;                        /* MSCAN 1 Receive Data Segment Register 6 */
volatile CAN1RXDSR7STR _CAN1RXDSR7;                        /* MSCAN 1 Receive Data Segment Register 7 */
volatile CAN1RXERRSTR _CAN1RXERR;                          /* MSCAN 1 Receive Error Counter Register */
volatile CAN1RXIDR0STR _CAN1RXIDR0;                        /* MSCAN 1 Receive Identifier Register 0 */
volatile CAN1RXIDR1STR _CAN1RXIDR1;                        /* MSCAN 1 Receive Identifier Register 1 */
volatile CAN1RXIDR2STR _CAN1RXIDR2;                        /* MSCAN 1 Receive Identifier Register 2 */
volatile CAN1RXIDR3STR _CAN1RXIDR3;                        /* MSCAN 1 Receive Identifier Register 3 */
volatile CAN1TAAKSTR _CAN1TAAK;                            /* MSCAN 1 Transmitter Message Abort Control */
volatile CAN1TARQSTR _CAN1TARQ;                            /* MSCAN 1 Transmitter Message Abort Request */
volatile CAN1TBSELSTR _CAN1TBSEL;                          /* MSCAN 1 Transmit Buffer Selection */
volatile CAN1TFLGSTR _CAN1TFLG;                            /* MSCAN 1 Transmitter Flag Register */
volatile CAN1TIERSTR _CAN1TIER;                            /* MSCAN 1 Transmitter Interrupt Enable Register */
volatile CAN1TXDLRSTR _CAN1TXDLR;                          /* MSCAN 1 Transmit Data Length Register */
volatile CAN1TXDSR0STR _CAN1TXDSR0;                        /* MSCAN 1 Transmit Data Segment Register 0 */
volatile CAN1TXDSR1STR _CAN1TXDSR1;                        /* MSCAN 1 Transmit Data Segment Register 1 */
volatile CAN1TXDSR2STR _CAN1TXDSR2;                        /* MSCAN 1 Transmit Data Segment Register 2 */
volatile CAN1TXDSR3STR _CAN1TXDSR3;                        /* MSCAN 1 Transmit Data Segment Register 3 */
volatile CAN1TXDSR4STR _CAN1TXDSR4;                        /* MSCAN 1 Transmit Data Segment Register 4 */
volatile CAN1TXDSR5STR _CAN1TXDSR5;                        /* MSCAN 1 Transmit Data Segment Register 5 */
volatile CAN1TXDSR6STR _CAN1TXDSR6;                        /* MSCAN 1 Transmit Data Segment Register 6 */
volatile CAN1TXDSR7STR _CAN1TXDSR7;                        /* MSCAN 1 Transmit Data Segment Register 7 */
volatile CAN1TXERRSTR _CAN1TXERR;                          /* MSCAN 1 Transmit Error Counter Register */
volatile CAN1TXIDR0STR _CAN1TXIDR0;                        /* MSCAN 1 Transmit Identifier Register 0 */
volatile CAN1TXIDR1STR _CAN1TXIDR1;                        /* MSCAN 1 Transmit Identifier Register 1 */
volatile CAN1TXIDR2STR _CAN1TXIDR2;                        /* MSCAN 1 Transmit Identifier Register 2 */
volatile CAN1TXIDR3STR _CAN1TXIDR3;                        /* MSCAN 1 Transmit Identifier Register 3 */
volatile CAN1TXTBPRSTR _CAN1TXTBPR;                        /* MSCAN 1 Transmit Buffer Priority */
volatile CAN2BTR0STR _CAN2BTR0;                            /* MSCAN 2 Bus Timing Register 0 */
volatile CAN2BTR1STR _CAN2BTR1;                            /* MSCAN 2 Bus Timing Register 1 */
volatile CAN2CTL0STR _CAN2CTL0;                            /* MSCAN 2 Control 0 Register */
volatile CAN2CTL1STR _CAN2CTL1;                            /* MSCAN 2 Control 1 Register */
volatile CAN2IDACSTR _CAN2IDAC;                            /* MSCAN 2 Identifier Acceptance Control Register */
volatile CAN2IDAR0STR _CAN2IDAR0;                          /* MSCAN 2 Identifier Acceptance Register 0 */
volatile CAN2IDAR1STR _CAN2IDAR1;                          /* MSCAN 2 Identifier Acceptance Register 1 */
volatile CAN2IDAR2STR _CAN2IDAR2;                          /* MSCAN 2 Identifier Acceptance Register 2 */
volatile CAN2IDAR3STR _CAN2IDAR3;                          /* MSCAN 2 Identifier Acceptance Register 3 */
volatile CAN2IDAR4STR _CAN2IDAR4;                          /* MSCAN 2 Identifier Acceptance Register 4 */
volatile CAN2IDAR5STR _CAN2IDAR5;                          /* MSCAN 2 Identifier Acceptance Register 5 */
volatile CAN2IDAR6STR _CAN2IDAR6;                          /* MSCAN 2 Identifier Acceptance Register 6 */
volatile CAN2IDAR7STR _CAN2IDAR7;                          /* MSCAN 2 Identifier Acceptance Register 7 */
volatile CAN2IDMR0STR _CAN2IDMR0;                          /* MSCAN 2 Identifier Mask Register 0 */
volatile CAN2IDMR1STR _CAN2IDMR1;                          /* MSCAN 2 Identifier Mask Register 1 */
volatile CAN2IDMR2STR _CAN2IDMR2;                          /* MSCAN 2 Identifier Mask Register 2 */
volatile CAN2IDMR3STR _CAN2IDMR3;                          /* MSCAN 2 Identifier Mask Register 3 */
volatile CAN2IDMR4STR _CAN2IDMR4;                          /* MSCAN 2 Identifier Mask Register 4 */
volatile CAN2IDMR5STR _CAN2IDMR5;                          /* MSCAN 2 Identifier Mask Register 5 */
volatile CAN2IDMR6STR _CAN2IDMR6;                          /* MSCAN 2 Identifier Mask Register 6 */
volatile CAN2IDMR7STR _CAN2IDMR7;                          /* MSCAN 2 Identifier Mask Register 7 */
volatile CAN2MISCSTR _CAN2MISC;                            /* MSCAN 2 Miscellaneous Register */
volatile CAN2RFLGSTR _CAN2RFLG;                            /* MSCAN 2 Receiver Flag Register */
volatile CAN2RIERSTR _CAN2RIER;                            /* MSCAN 2 Receiver Interrupt Enable Register */
volatile CAN2RXDLRSTR _CAN2RXDLR;                          /* MSCAN 2 Receive Data Length Register */
volatile CAN2RXDSR0STR _CAN2RXDSR0;                        /* MSCAN 2 Receive Data Segment Register 0 */
volatile CAN2RXDSR1STR _CAN2RXDSR1;                        /* MSCAN 2 Receive Data Segment Register 1 */
volatile CAN2RXDSR2STR _CAN2RXDSR2;                        /* MSCAN 2 Receive Data Segment Register 2 */
volatile CAN2RXDSR3STR _CAN2RXDSR3;                        /* MSCAN 2 Receive Data Segment Register 3 */
volatile CAN2RXDSR4STR _CAN2RXDSR4;                        /* MSCAN 2 Receive Data Segment Register 4 */
volatile CAN2RXDSR5STR _CAN2RXDSR5;                        /* MSCAN 2 Receive Data Segment Register 5 */
volatile CAN2RXDSR6STR _CAN2RXDSR6;                        /* MSCAN 2 Receive Data Segment Register 6 */
volatile CAN2RXDSR7STR _CAN2RXDSR7;                        /* MSCAN 2 Receive Data Segment Register 7 */
volatile CAN2RXERRSTR _CAN2RXERR;                          /* MSCAN 2 Receive Error Counter Register */
volatile CAN2RXIDR0STR _CAN2RXIDR0;                        /* MSCAN 2 Receive Identifier Register 0 */
volatile CAN2RXIDR1STR _CAN2RXIDR1;                        /* MSCAN 2 Receive Identifier Register 1 */
volatile CAN2RXIDR2STR _CAN2RXIDR2;                        /* MSCAN 2 Receive Identifier Register 2 */
volatile CAN2RXIDR3STR _CAN2RXIDR3;                        /* MSCAN 2 Receive Identifier Register 3 */
volatile CAN2TAAKSTR _CAN2TAAK;                            /* MSCAN 2 Transmitter Message Abort Control */
volatile CAN2TARQSTR _CAN2TARQ;                            /* MSCAN 2 Transmitter Message Abort Request */
volatile CAN2TBSELSTR _CAN2TBSEL;                          /* MSCAN 2 Transmit Buffer Selection */
volatile CAN2TFLGSTR _CAN2TFLG;                            /* MSCAN 2 Transmitter Flag Register */
volatile CAN2TIERSTR _CAN2TIER;                            /* MSCAN 2 Transmitter Interrupt Enable Register */
volatile CAN2TXDLRSTR _CAN2TXDLR;                          /* MSCAN 2 Transmit Data Length Register */
volatile CAN2TXDSR0STR _CAN2TXDSR0;                        /* MSCAN 2 Transmit Data Segment Register 0 */
volatile CAN2TXDSR1STR _CAN2TXDSR1;                        /* MSCAN 2 Transmit Data Segment Register 1 */
volatile CAN2TXDSR2STR _CAN2TXDSR2;                        /* MSCAN 2 Transmit Data Segment Register 2 */
volatile CAN2TXDSR3STR _CAN2TXDSR3;                        /* MSCAN 2 Transmit Data Segment Register 3 */
volatile CAN2TXDSR4STR _CAN2TXDSR4;                        /* MSCAN 2 Transmit Data Segment Register 4 */
volatile CAN2TXDSR5STR _CAN2TXDSR5;                        /* MSCAN 2 Transmit Data Segment Register 5 */
volatile CAN2TXDSR6STR _CAN2TXDSR6;                        /* MSCAN 2 Transmit Data Segment Register 6 */
volatile CAN2TXDSR7STR _CAN2TXDSR7;                        /* MSCAN 2 Transmit Data Segment Register 7 */
volatile CAN2TXERRSTR _CAN2TXERR;                          /* MSCAN 2 Transmit Error Counter Register */
volatile CAN2TXIDR0STR _CAN2TXIDR0;                        /* MSCAN 2 Transmit Identifier Register 0 */
volatile CAN2TXIDR1STR _CAN2TXIDR1;                        /* MSCAN 2 Transmit Identifier Register 1 */
volatile CAN2TXIDR2STR _CAN2TXIDR2;                        /* MSCAN 2 Transmit Identifier Register 2 */
volatile CAN2TXIDR3STR _CAN2TXIDR3;                        /* MSCAN 2 Transmit Identifier Register 3 */
volatile CAN2TXTBPRSTR _CAN2TXTBPR;                        /* MSCAN 2 Transmit Buffer Priority */
volatile CAN3BTR0STR _CAN3BTR0;                            /* MSCAN 3 Bus Timing Register 0 */
volatile CAN3BTR1STR _CAN3BTR1;                            /* MSCAN 3 Bus Timing Register 1 */
volatile CAN3CTL0STR _CAN3CTL0;                            /* MSCAN 3 Control 0 Register */
volatile CAN3CTL1STR _CAN3CTL1;                            /* MSCAN 3 Control 1 Register */
volatile CAN3IDACSTR _CAN3IDAC;                            /* MSCAN 3 Identifier Acceptance Control Register */
volatile CAN3IDAR0STR _CAN3IDAR0;                          /* MSCAN 3 Identifier Acceptance Register 0 */
volatile CAN3IDAR1STR _CAN3IDAR1;                          /* MSCAN 3 Identifier Acceptance Register 1 */
volatile CAN3IDAR2STR _CAN3IDAR2;                          /* MSCAN 3 Identifier Acceptance Register 2 */
volatile CAN3IDAR3STR _CAN3IDAR3;                          /* MSCAN 3 Identifier Acceptance Register 3 */
volatile CAN3IDAR4STR _CAN3IDAR4;                          /* MSCAN 3 Identifier Acceptance Register 4 */
volatile CAN3IDAR5STR _CAN3IDAR5;                          /* MSCAN 3 Identifier Acceptance Register 5 */
volatile CAN3IDAR6STR _CAN3IDAR6;                          /* MSCAN 3 Identifier Acceptance Register 6 */
volatile CAN3IDAR7STR _CAN3IDAR7;                          /* MSCAN 3 Identifier Acceptance Register 7 */
volatile CAN3IDMR0STR _CAN3IDMR0;                          /* MSCAN 3 Identifier Mask Register 0 */
volatile CAN3IDMR1STR _CAN3IDMR1;                          /* MSCAN 3 Identifier Mask Register 1 */
volatile CAN3IDMR2STR _CAN3IDMR2;                          /* MSCAN 3 Identifier Mask Register 2 */
volatile CAN3IDMR3STR _CAN3IDMR3;                          /* MSCAN 3 Identifier Mask Register 3 */
volatile CAN3IDMR4STR _CAN3IDMR4;                          /* MSCAN 3 Identifier Mask Register 4 */
volatile CAN3IDMR5STR _CAN3IDMR5;                          /* MSCAN 3 Identifier Mask Register 5 */
volatile CAN3IDMR6STR _CAN3IDMR6;                          /* MSCAN 3 Identifier Mask Register 6 */
volatile CAN3IDMR7STR _CAN3IDMR7;                          /* MSCAN 3 Identifier Mask Register 7 */
volatile CAN3MISCSTR _CAN3MISC;                            /* MSCAN 3 Miscellaneous Register */
volatile CAN3RFLGSTR _CAN3RFLG;                            /* MSCAN 3 Receiver Flag Register */
volatile CAN3RIERSTR _CAN3RIER;                            /* MSCAN 3 Receiver Interrupt Enable Register */
volatile CAN3RXDLRSTR _CAN3RXDLR;                          /* MSCAN 3 Receive Data Length Register */
volatile CAN3RXDSR0STR _CAN3RXDSR0;                        /* MSCAN 3 Receive Data Segment Register 0 */
volatile CAN3RXDSR1STR _CAN3RXDSR1;                        /* MSCAN 3 Receive Data Segment Register 1 */
volatile CAN3RXDSR2STR _CAN3RXDSR2;                        /* MSCAN 3 Receive Data Segment Register 2 */
volatile CAN3RXDSR3STR _CAN3RXDSR3;                        /* MSCAN 3 Receive Data Segment Register 3 */
volatile CAN3RXDSR4STR _CAN3RXDSR4;                        /* MSCAN 3 Receive Data Segment Register 4 */
volatile CAN3RXDSR5STR _CAN3RXDSR5;                        /* MSCAN 3 Receive Data Segment Register 5 */
volatile CAN3RXDSR6STR _CAN3RXDSR6;                        /* MSCAN 3 Receive Data Segment Register 6 */
volatile CAN3RXDSR7STR _CAN3RXDSR7;                        /* MSCAN 3 Receive Data Segment Register 7 */
volatile CAN3RXERRSTR _CAN3RXERR;                          /* MSCAN 3 Receive Error Counter Register */
volatile CAN3RXIDR0STR _CAN3RXIDR0;                        /* MSCAN 3 Receive Identifier Register 0 */
volatile CAN3RXIDR1STR _CAN3RXIDR1;                        /* MSCAN 3 Receive Identifier Register 1 */
volatile CAN3RXIDR2STR _CAN3RXIDR2;                        /* MSCAN 3 Receive Identifier Register 2 */
volatile CAN3RXIDR3STR _CAN3RXIDR3;                        /* MSCAN 3 Receive Identifier Register 3 */
volatile CAN3TAAKSTR _CAN3TAAK;                            /* MSCAN 3 Transmitter Message Abort Control */
volatile CAN3TARQSTR _CAN3TARQ;                            /* MSCAN 3 Transmitter Message Abort Request */
volatile CAN3TBSELSTR _CAN3TBSEL;                          /* MSCAN 3 Transmit Buffer Selection */
volatile CAN3TFLGSTR _CAN3TFLG;                            /* MSCAN 3 Transmitter Flag Register */
volatile CAN3TIERSTR _CAN3TIER;                            /* MSCAN 3 Transmitter Interrupt Enable Register */
