frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.c
volatile SCI1DRHSTR _SCI1DRH;                              /* SCI 1 Data Register High */
volatile SCI1DRLSTR _SCI1DRL;                              /* SCI 1 Data Register Low */
volatile SCI1SR1STR _SCI1SR1;                              /* SCI 1 Status Register 1 */
volatile SCI1SR2STR _SCI1SR2;                              /* SCI 1 Status Register 2 */
volatile SCI2ASR1STR _SCI2ASR1;                            /* SCI 2 Alternative Status Register 1 */
volatile SCI2CR2STR _SCI2CR2;                              /* SCI 2 Control Register 2 */
volatile SCI2DRHSTR _SCI2DRH;                              /* SCI 2 Data Register High */
volatile SCI2DRLSTR _SCI2DRL;                              /* SCI 2 Data Register Low */
volatile SCI2SR1STR _SCI2SR1;                              /* SCI 2 Status Register 1 */
volatile SCI2SR2STR _SCI2SR2;                              /* SCI 2 Status Register 2 */
volatile SCI3ASR1STR _SCI3ASR1;                            /* SCI 3 Alternative Status Register 1 */
volatile SCI3CR2STR _SCI3CR2;                              /* SCI 3 Control Register 2 */
volatile SCI3DRHSTR _SCI3DRH;                              /* SCI 3 Data Register High */
volatile SCI3DRLSTR _SCI3DRL;                              /* SCI 3 Data Register Low */
volatile SCI3SR1STR _SCI3SR1;                              /* SCI 3 Status Register 1 */
volatile SCI3SR2STR _SCI3SR2;                              /* SCI 3 Status Register 2 */
volatile SCI4ASR1STR _SCI4ASR1;                            /* SCI 4 Alternative Status Register 1 */
volatile SCI4CR2STR _SCI4CR2;                              /* SCI 4 Control Register 2 */
volatile SCI4DRHSTR _SCI4DRH;                              /* SCI 4 Data Register High */
volatile SCI4DRLSTR _SCI4DRL;                              /* SCI 4 Data Register Low */
volatile SCI4SR1STR _SCI4SR1;                              /* SCI 4 Status Register 1 */
volatile SCI4SR2STR _SCI4SR2;                              /* SCI 4 Status Register 2 */
volatile SCI5ASR1STR _SCI5ASR1;                            /* SCI 5 Alternative Status Register 1 */
volatile SCI5CR2STR _SCI5CR2;                              /* SCI 5 Control Register 2 */
volatile SCI5DRHSTR _SCI5DRH;                              /* SCI 5 Data Register High */
volatile SCI5DRLSTR _SCI5DRL;                              /* SCI 5 Data Register Low */
volatile SCI5SR1STR _SCI5SR1;                              /* SCI 5 Status Register 1 */
volatile SCI5SR2STR _SCI5SR2;                              /* SCI 5 Status Register 2 */
volatile SPI0BRSTR _SPI0BR;                                /* SPI 0 Baud Rate Register */
volatile SPI0CR1STR _SPI0CR1;                              /* SPI 0 Control Register */
volatile SPI0CR2STR _SPI0CR2;                              /* SPI 0 Control Register 2 */
volatile SPI0DRSTR _SPI0DR;                                /* SPI 0 Data Register */
volatile SPI0SRSTR _SPI0SR;                                /* SPI 0 Status Register */
volatile SPI1BRSTR _SPI1BR;                                /* SPI 1 Baud Rate Register */
volatile SPI1CR1STR _SPI1CR1;                              /* SPI 1 Control Register */
volatile SPI1CR2STR _SPI1CR2;                              /* SPI 1 Control Register 2 */
volatile SPI1DRSTR _SPI1DR;                                /* SPI 1 Data Register */
volatile SPI1SRSTR _SPI1SR;                                /* SPI 1 Status Register */
volatile SPI2BRSTR _SPI2BR;                                /* SPI 2 Baud Rate Register */
volatile SPI2CR1STR _SPI2CR1;                              /* SPI 2 Control Register */
volatile SPI2CR2STR _SPI2CR2;                              /* SPI 2 Control Register 2 */
volatile SPI2DRSTR _SPI2DR;                                /* SPI 2 Data Register */
volatile SPI2SRSTR _SPI2SR;                                /* SPI 2 Status Register */
volatile SYNRSTR _SYNR;                                    /* CRG Synthesizer Register */
volatile TCTL1STR _TCTL1;                                  /* Timer Control Register 1 */
volatile TCTL2STR _TCTL2;                                  /* Timer Control Register 2 */
volatile TCTL3STR _TCTL3;                                  /* Timer Control Register 3 */
volatile TCTL4STR _TCTL4;                                  /* Timer Control Register 4 */
volatile TFLG1STR _TFLG1;                                  /* Main Timer Interrupt Flag 1 */
volatile TFLG2STR _TFLG2;                                  /* Main Timer Interrupt Flag 2 */
volatile TIESTR _TIE;                                      /* Timer Interrupt Enable Register */
volatile TIOSSTR _TIOS;                                    /* Timer Input Capture/Output Compare Select */
volatile TSCR1STR _TSCR1;                                  /* Timer System Control Register1 */
volatile TSCR2STR _TSCR2;                                  /* Timer System Control Register 2 */
volatile TTOVSTR _TTOV;                                    /* Timer Toggle On Overflow Register */
volatile VREGAPICLSTR _VREGAPICL;                          /* VREG_3V3 - Autonomous Periodical Interrupt Control Register */
volatile VREGAPITRSTR _VREGAPITR;                          /* VREG_3V3 - Autonomous Periodical Interrupt Trimming Register */
volatile VREGCTRLSTR _VREGCTRL;                            /* VREG_3V3 - Control Register */
volatile WOMMSTR _WOMM;                                    /* Port M Wired-Or Mode Register */
volatile WOMSSTR _WOMS;                                    /* Port S Wired-Or Mode Register */
volatile XGCHIDSTR _XGCHID;                                /* XGATE Channel ID Register */
volatile XGMCTLSTR _XGMCTL;                                /* XGATE Module Control Register */
volatile XSCTRLSTR _XSCTRL;                                /* XSRAM Control Register */
volatile XSSRLBSTR _XSSRLB;                                /* XSRAM XGATE Code Region Lower Boundary Register */
volatile XSSRUBSTR _XSSRUB;                                /* XSRAM Shared Region Upper Boundary Register */
volatile XSXCUBSTR _XSXCUB;                                /* XSRAM XGATE Code Region Upper Boundary Register */


